<b>DESAFIO PYTHON</b>

1 - Ler Json de entrada do object storage
Criar 3 funções diferentes que mostrem as entradas ordenadas por:
Data;
Nome;
Valor;

2 - Dada uma entrada CSV do object storage
Criar uma função mostre o conteúdo do CSV sem repetições em ordem alfabética

3 - Criar um programa que receba a entrada do usuário, pedindo a(s) resposta(s) para a função:
xˆ2 + 2*x - 20
E envie a mensagem “Parabéns” caso o usuário tenha acertado, caso contrário envie “Essa não é bem a resposta correta, a resposta correta é: respostas”

In [1]:
# importa as bibliotecas
import types
import pandas as pd
from botocore.client import Config
import ibm_boto3

#chamada do json
def __iter__(self): return 0

# @hidden_cell
# The following code accesses a file in your IBM Cloud Object Storage. It includes your credentials.
# You might want to remove those credentials before you share the notebook.

#credenciais
client_db745ac9370d4c78b205950a8c35575d = ibm_boto3.client(service_name='s3',
    ibm_api_key_id='T5S8zyYd14NthAtSNtAhTHvqiO5o-FJy0Y4_TyPgtb7-',
    ibm_auth_endpoint="https://iam.ng.bluemix.net/oidc/token",
    config=Config(signature_version='oauth'),
    endpoint_url='https://s3-api.us-geo.objectstorage.service.networklayer.com')

body = client_db745ac9370d4c78b205950a8c35575d.get_object(Bucket='desafiopython-donotdelete-pr-atrvkqcqqumgog',Key='data.json')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object 

if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

# Since JSON data can be semi-structured and contain additional metadata, it is possible that you might face an error during data loading.
# Please read the documentation of 'pandas.read_json()' and 'pandas.io.json.json_normalize' to learn more about the possibilities to adjust the data loading.
# pandas documentation: http://pandas.pydata.org/pandas-docs/stable/io.html#io-json-reader
# and http://pandas.pydata.org/pandas-docs/stable/generated/pandas.io.json.json_normalize.html

# df_data_1 = pd.read_json(body, orient='values')
# df_data_1.head()

In [8]:
#criação do dataframe e visualização dos primeiros
df = pd.read_json(body, orient='values')
df.head()

        date    name  value
0 2018-12-12  Kimble  93.28
1 2019-03-08  Alanna  10.51
2 2019-10-09     Jay  29.41
3 2019-07-28  Rustin  47.94
4 2019-03-23   Pedro  98.77

<b>EXERCÍCIO 1 </b>- Ler Json de entrada do object storage
Criar 3 funções diferentes que mostrem as entradas ordenadas por:

Data

In [6]:
#criação função de ordenação por data
def func_date(df):
        return df.sort_values(['date'])

In [7]:
#chamada da função
func_date(df)

         date         name  value
16 2018-11-23       Culver  68.38
15 2018-11-24        Xenia  43.61
0  2018-12-12       Kimble  93.28
10 2019-01-13     Kristine  26.09
24 2019-01-27   Christabel  73.09
13 2019-02-03     Claudine  26.28
8  2019-02-14        Graig  79.75
1  2019-03-08       Alanna  10.51
5  2019-03-21         Isac   5.21
4  2019-03-23        Pedro  98.77
14 2019-04-07      Honoria  93.40
6  2019-04-10        Gayla  40.03
20 2019-04-11      Jackson  53.92
17 2019-05-14       Paddie  99.52
23 2019-05-25         Jack  87.38
22 2019-06-18     Christie  83.61
3  2019-07-28       Rustin  47.94
19 2019-08-02        Tadio   4.40
18 2019-08-17         Livy  51.81
12 2019-08-21         Teri  22.17
2  2019-10-09          Jay  29.41
11 2019-10-10      Brenden  41.40
7  2019-10-16      Ransell  80.89
21 2019-10-19        Elise  35.62
9  2019-10-21  Jacquenetta  97.73

Nome;

In [11]:
#criação função de ordenção por nome
def func_name(df):
        return df.sort_values(['name'])

In [12]:
#chamada da função
func_name(df)

         date         name  value
1  2019-03-08       Alanna  10.51
11 2019-10-10      Brenden  41.40
24 2019-01-27   Christabel  73.09
22 2019-06-18     Christie  83.61
13 2019-02-03     Claudine  26.28
16 2018-11-23       Culver  68.38
21 2019-10-19        Elise  35.62
6  2019-04-10        Gayla  40.03
8  2019-02-14        Graig  79.75
14 2019-04-07      Honoria  93.40
5  2019-03-21         Isac   5.21
23 2019-05-25         Jack  87.38
20 2019-04-11      Jackson  53.92
9  2019-10-21  Jacquenetta  97.73
2  2019-10-09          Jay  29.41
0  2018-12-12       Kimble  93.28
10 2019-01-13     Kristine  26.09
18 2019-08-17         Livy  51.81
17 2019-05-14       Paddie  99.52
4  2019-03-23        Pedro  98.77
7  2019-10-16      Ransell  80.89
3  2019-07-28       Rustin  47.94
19 2019-08-02        Tadio   4.40
12 2019-08-21         Teri  22.17
15 2018-11-24        Xenia  43.61

Valor;

In [13]:
#criação função ordenação por valor
def func_value(df):
        return df.sort_values(['value'])

In [14]:
#chamada da função
func_value(df)

         date         name  value
19 2019-08-02        Tadio   4.40
5  2019-03-21         Isac   5.21
1  2019-03-08       Alanna  10.51
12 2019-08-21         Teri  22.17
10 2019-01-13     Kristine  26.09
13 2019-02-03     Claudine  26.28
2  2019-10-09          Jay  29.41
21 2019-10-19        Elise  35.62
6  2019-04-10        Gayla  40.03
11 2019-10-10      Brenden  41.40
15 2018-11-24        Xenia  43.61
3  2019-07-28       Rustin  47.94
18 2019-08-17         Livy  51.81
20 2019-04-11      Jackson  53.92
16 2018-11-23       Culver  68.38
24 2019-01-27   Christabel  73.09
8  2019-02-14        Graig  79.75
7  2019-10-16      Ransell  80.89
22 2019-06-18     Christie  83.61
23 2019-05-25         Jack  87.38
0  2018-12-12       Kimble  93.28
14 2019-04-07      Honoria  93.40
9  2019-10-21  Jacquenetta  97.73
4  2019-03-23        Pedro  98.77
17 2019-05-14       Paddie  99.52

<b>EXERCÍCIO 2 </b>- Dada uma entrada CSV do object storage
Criar uma função mostre o conteúdo do CSV sem repetições em ordem alfabética
Python Local

In [15]:
body = client_db745ac9370d4c78b205950a8c35575d.get_object(Bucket='desafiopython-donotdelete-pr-atrvkqcqqumgog',Key='data.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

#criação dataframe e visualização dos primeiros
df_2 = pd.read_csv(body)
df_2.head()

       name
0       Rog
1  Robinett
2    Stacee
3    Rutter
4     Candi

In [16]:
#função para retirar repetições e ordenar por nome
def func_rep(df_2):
    df_2.drop_duplicates(subset=None, keep='first', inplace=False)
    return df_2.sort_values(['name'])

In [17]:
#chamada da função
func_rep(df_2)

           name
73     Adrianne
74        Alene
46   Alessandro
20       Alfons
99      Anthony
75        Armin
51      Artemis
41        Berne
90        Bunni
35         Calv
4         Candi
92       Carlyn
67       Caspar
79     Christie
80       Cindie
29     Clarence
12     Clarisse
85         Codi
60  Constantino
84   Cristionna
97        Daffi
21        Daune
13        Druci
22    Ellswerth
34        Elora
62    Fanchette
89        Fanya
5        Farica
59        Gaile
6       Garrard
..          ...
82        Perle
57   Philippine
23       Portia
14      Rafaela
33    Reginauld
11        Reine
72      Reinold
47        Retha
30      Riobard
1      Robinett
0           Rog
58      Rozelle
3        Rutter
53       Shandy
25        Slade
49       Sorcha
2        Stacee
76       Steven
61         Sven
40       Tandie
71       Tanney
48        Tasha
18      Theresa
7         Venus
26        Verne
28        Vevay
52      Whitney
86      William
15        Wolfy
87        Zarah

[100 rows x 1 columns]

In [ ]:
print("Considerando a função de segundo grau: xˆ2 + 2*x - 20 = 0")
#solicita entrada das duas raizes.
r1 = input("Digite o valor da primeira raiz:")
r2 = input("Digite o valor da segunda raiz:")
#definidas as variaveis da função
a = 1
b = 2
c = -20
#calculo do delta
delta = b**2-4*a*c
#calculo das duas raizes
raiz1 = (-b+(delta**(1/2)))/2*a
raiz1 = round(raiz1, 2)
raiz2 = (-b-(delta**(1/2)))/2*a
raiz2 = round(raiz2, 2)
#se ambas as raizes forem iguais as respostas então está correto
if (float(r1) == raiz1 or float(r1) == raiz2) and (float(r2) == raiz1 or float(r1) == raiz2):
    print("Correto")
else:
    print("Errado! As raizes da função são " + str(raiz1) + " e " + str(raiz2))